app/Http/Controllers/SuperAdmin/PermissionController.php

    public function index()
    {
        $permissions = Permission::latest()->get();
---
select * from `permissions` order by `created_at` desc