app/Http/Controllers/SuperAdmin/RoleController.php

select * from `roles` order by `created_at` desc
---
    public function index()
    {
        $roles = Role::latest()->get();

select * from `permissions`
---
    public function edit($id)
    {
        $role = Role::findOrFail($id);
        $permissions = Permission::all();