app/Http/Controllers/Admin/AreaController.php

select * from `areas` order by `created_at` desc
---
    public function index()
    {

        $areas = Area::latest()->get();