app/Http/Controllers/Admin/BranchController.php

    public function index()
    {
        $branches = Branch::latest()->get();
---
select * from `branches` order by `created_at` desc