app/Http/Controllers/Admin/CategoryController.php

select * from `categories` order by `created_at` desc
---
    public function index()
    {
        $categories = Category::latest()->get();