app/Http/Controllers/Admin/CompanyController.php

    public function index()
    {
        $companies = Company::latest()->get();
---
select * from `companies` order by `created_at` desc