app/Http/Controllers/Admin/FarmerController.php

    public function index()
    {
        $farmers = Farmer::latest()->get();
---
select * from `farmers` order by `created_at` desc