app/Http/Controllers/Admin/SubCategoryController.php

    public function index()
    {
        $subcategories = SubCategory::latest()->get();
---
select * from `sub_categories` order by `created_at` desc